[
  {
    "name": "IFC Info Session",
    "description": "An informative presentation on Northeastern Fraternity Rush and opportunity to meet our brothers and the IFC",
    "datetime": "2025-09-05T18:30:00",
    "location": "Dodge Hall",
    "image": "images/pongTrophy.JPG",
    "open": true
  },
  {
    "name": "GATOR ROAST",
    "description": "We bring in a freshly hunted Florida bayou alligator, coat it with our secret spice blend, and slow-cook it over an open fire for eight hours. The finished roast is served to brothers, alumni, and PNMs as we gather together, share stories, and get to know one another.",
    "datetime": "2025-09-06T14:00:00",
    "location": "814 Parker St",
    "image": "images/pongTrophy.JPG",
    "open": true
  },
  {
    "name": "Canes & Games",
    "description": "An afternoon of spikeball, cornhole, die, and lawn games at West Village Quad, paired with a catered Raising Cane?s dinner. It?s the perfect chance to relax, enjoy some great food, and bond over friendly competition.",
    "datetime": "2025-09-10T18:30:00",
    "location": "West Village Quad",
    "image": "images/pongTrophy.JPG",
    "open": true
  },
  {
    "name": "IFC BBQ",
    "description": "BBQ catered by the IFC in Centennial Commons.",
    "datetime": "2025-09-13T12:00:00",
    "location": "Centenial Quad",
    "image": "images/pongTrophy.JPG",
    "open": true
  },
  {
    "name": "House Tours",
    "description": "PNMs are guided through our nine houses in Mission Hill, showcasing our rooms, backyards, and event spaces. The night wraps up with dinner, s?mores, and a campfire hangout at one of the houses.",
    "datetime": "2025-09-15T19:00:00",
    "location": "Mission Hill",
    "image": "images/pongTrophy.JPG",
    "open": false
  },
  {
    "name": "Pancakes & Pong",
    "description": "PNMs team up with a brother of their choice for a bracket-style pong tournament, all competing for the legendary DKE Trophy. Alongside the tournament, we serve up fresh pancakes and sausages to keep everyone fueled during the games.",
    "datetime": "2025-09-18T18:30:00",
    "location": "4 Cherokee St",
    "image": "images/pongTrophy.JPG",
    "open": false
  },
  {
    "name": "Banquet",
    "description": "Our formal banquet, held on campus and catered by our favorite Italian restaurant, is a night of connection and celebration. Over dinner, speeches, and shared stories, brothers and PNMs get the chance to build meaningful bonds in a more formal setting.",
    "datetime": "2025-09-23T00:01:00",
    "location": "Invite Only",
    "image": "images/pongTrophy.JPG",
    "open": false
  }
]
